Revit 2026 API

# WallPaintWallpaintFinish Property

---

The property labeled "Finish" from the "WallPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WallpaintFinish { get; }
```
```vb
Public Shared ReadOnly Property WallpaintFinish As String
	Get
```
```cpp
public:
static property String^ WallpaintFinish {
	String^ get ();
}
```
```fsharp
static member WallpaintFinish : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".

#### Reference

WallPaint Class

Autodesk.Revit.DB.Visual Namespace